Revit 2026 API

# RoutingConditions Class

---

RoutingConditions contain routing information that is used as input when determining if a routing criterion, such as minimum or maximum diameter, is met.

SystemObject Autodesk.Revit.DBRoutingConditions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RoutingConditions : IDisposable
```
```vb
Public Class RoutingConditions
	Implements IDisposable
```
```cpp
public ref class RoutingConditions : IDisposable
```
```fsharp
type RoutingConditions =
    class
        interface IDisposable
    end
```

The RoutingConditions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RoutingConditions | Constructs a new instance of a RoutingConditions object with an indicated error level for conditions that do not meet any routing preference rule. |

|  | Name | Description |
| --- | --- | --- |
|  | ErrorLevel | The error level that the routing preference manager should post errors if the routing conditions do not meet any routing preference rule, could be None, Warning, or Error |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PreferredJunctionType | The junction type (Tee or Tap) to select if defined fittings of both junction types meet all routing conditions. |

|  | Name | Description |
| --- | --- | --- |
|  | AppendCondition | Appends a routing condition to the end of existing routing conditions. Note that the first item (indexed at 0) is the condition for the primary connector. |
|  | Clear | Clear all existing conditions |
|  | Dispose | Releases all resources used by the RoutingConditions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetConditionAt | Gets the routing condition at the specified index position. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetNumberOfConditions | Gets the number of included routing conditions. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace